import React, { useState, useEffect, useRef } from "react";
import { View, Text, StyleSheet, ScrollView } from "react-native";
import RegistrationStep, { StepValidationProps } from "../RegistrationStep";

export default function TermsStep(props: StepValidationProps) {
  const [checked, setChecked] = useState(false);

  useEffect(() => {
    setChecked(true);
  }, []);

  const termsAndConditions = `Перед початком використання мобільного додатку уважно ознайомтесь із цими правилами. Реєструючись у додатку, Ви підтверджуєте, що ознайомлені з умовами та погоджуєтесь їх дотримуватись.
    1. Загальні положення
    1.1. Ця платформа створена для спілкування користувачів на основі спільних інтересів.
    1.2. Метою додатку є створення безпечного, доброзичливого та змістовного середовища для обміну думками, контентом і досвідом.
    1.3. Використання додатку є добровільним та безкоштовним (монетизація може з’явитись пізніше з попередженням користувачів).
    
    2. Обліковий запис користувача
    2.1. Для повноцінного доступу до функціоналу необхідна реєстрація.
    2.2. Ви зобов’язуєтесь надавати правдиву інформацію під час реєстрації та користування додатком.
    2.3. Ви несете відповідальність за збереження конфіденційності свого пароля та доступу до облікового запису.
    
    3. Поведінка в додатку
    3.1. Заборонено:
    - ображати інших користувачів або використовувати мову ворожнечі;
    - публікувати неприйнятний, непристойний чи незаконний контент;
    - видавати себе за іншу особу;
    - використовувати додаток з метою спаму, шахрайства чи маніпуляцій.
    
    3.2. Ви погоджуєтесь дотримуватись норм етикету, поваги та законів.
    
    4. Контент і інтереси
    4.1. Контент, який ви створюєте, повинен відповідати тематиці додатку.
    4.2. Система підбирає співрозмовників автоматично, на основі вподобань.
    4.3. Ви маєте право редагувати або видаляти свій контент у будь-який момент.
    
    5. Безпека та модерація
    5.1. Адміністрація залишає за собою право обмежити доступ до додатку користувачам, які порушують правила.
    5.2. Ми залишаємо за собою право видаляти контент, який порушує умови або шкодить спільноті.
    5.3. У разі серйозних порушень інформація може бути передана відповідним органам.
    
    6. Зміни до правил
    6.1. Умови використання можуть бути оновлені. У такому разі ми повідомимо вас про зміни. Продовження використання додатку означає вашу згоду з оновленими правилами.
    
    7. Підтвердження згоди
    Реєструючись або використовуючи додаток, ви підтверджуєте, що прочитали ці умови, зрозуміли їх та погоджуєтесь дотримуватись.`;

  return (
    <RegistrationStep
      image={require("../../../assets/images/main-character-asks.png")}
      title="Ознайомтесь з правилами"
      isStepValid={checked}
    >
      <View style={styles.container}>
        <Text style={styles.label}>
          Натискаючи "Далі", ви підтверджуєте, що ознайомлені з правилами
        </Text>
        <ScrollView
          style={styles.textContainer}
          scrollEventThrottle={16}
          showsVerticalScrollIndicator={true}
        >
          <Text>{termsAndConditions}</Text>
        </ScrollView>
      </View>
    </RegistrationStep>
  );
}

const styles = StyleSheet.create({
  container: {
    flex: 1,
    justifyContent: "center",
    alignItems: "center",
    gap: 8,
  },
  label: {
    fontSize: 16,
    color: "#333",
  },
  textContainer: {
    minHeight: 120,
    width: "100%",
    overflow: "scroll",
    borderWidth: 1,
    borderColor: "#cecece",
    borderRadius: 16,
    padding: 8,
    scrollbarWidth: "none",
    msOverflowStyle: "none",
  },
});
